# SELECT, DELETE, UPDATE and ALTER

## SELECT
The SELECT statement is used to select data from a database.
The data returned is stored in a result table.  
`SELECT col1, col2, ... FROM table_name`  

For example:
``` sql
SELECT product_name, price FROM products;
```
To select all the columns, we can write a `*` in place of column names.
``` sql
SELECT * FROM products;
```

## DELETE
The DELETE statement is used to delete existing records in a table.  
`DELETE FROM table_name WHERE condition;`  


For example:
``` sql
DELETE FROM products WHERE id = 1;
```
**Note:** Be careful when deleting records in a table! If you omit the WHERE clause, all records in the table will be deleted!

## UPDATE
The UPDATE statement is used to modify the existing records in a table.  
`UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;`

For example:
``` sql
UPDATE products SET price = 100, quantity = 34 WHERE id = 1;
```

**NOTE:** If you omit the WHERE clause, all records in the table will be updated!

## ALTER
1. The ALTER statement is used to add, delete, or modify columns in an existing table.  
`ALTER TABLE table_name ADD column_name datatype;`  
`ALTER TABLE table_name DROP COLUMN column_name;`  
`ALTER TABLE table_name MODIFY COLUMN column_name datatype;`  

For example:  
``` sql
ALTER TABLE products ADD description VARCHAR(255);  
ALTER TABLE products DROP COLUMN description;  
ALTER TABLE products MODIFY COLUMN price INT;  
```

2. We can also use the ALTER statement to rename a table.  
`ALTER TABLE table_name RENAME TO new_table_name;`  

For example:  
``` sql  
ALTER TABLE products RENAME TO items;  
```

3. We can also use the ALTER statement to rename a column.  
`ALTER TABLE table_name CHANGE old_column_name new_column_name datatype;`  

For example:  
``` sql
ALTER TABLE products CHANGE price cost INT;
```

4. We can also use the ALTER statement to add or drop a primary or foreign key.  
`ALTER TABLE table_name ADD PRIMARY KEY (column_name);`  
`ALTER TABLE table_name DROP PRIMARY KEY;`  
`ALTER TABLE table_name ADD FOREIGN KEY (column_name) REFERENCES other_table(column_name);`  
`ALTER TABLE table_name DROP FOREIGN KEY fk_name;`  

For example:  
``` sql
ALTER TABLE products ADD PRIMARY KEY (id);  
ALTER TABLE products ADD FOREIGN KEY (category_id) REFERENCES categories(id);  
```